import styled from "styled-components";

type Props = {};

const TransBox = styled.div`
  position: relative;
  top: 10px;
  margin-top: 150px;
  margin-bottom: 10px;
  width: 100%;
  background: #ed1b23;
  clip-path: polygon(0 100px, 100% 0, 100% 100%, 0% 100%);
  opacity: 0.7;
`;

const TransBoxBorder = styled.div`
  display: flex;
  flex-direction: column;
  align-items: center;
  left: 150px;
  margin-top: 103px;
  width: 100%;
  background: #171717;
  clip-path: polygon(0 107px, 100% 0, 100% 100%, 0% 100%);
  transform: translate(0, 2px);
`;
const AbUsh = styled.h1`
  text-transform: uppercase;
  color: #fff;
  z-index: 10;
  text-align: center;
  text-transform: uppercase;
  line-height: 100px;
  width: 100%;
  bottom: 690px;
`;

const PaboutText = styled.p`
  padding: 15px 20px;
  color: #fff;
  text-align: left;
  font-weight: 400;
  font-size: clamp(15px, 1vw, 24px);
`;

const PaboutTextTitle = styled.p`
  padding: 100px 60px 10px 60px;
  margin-bottom: 20px;
  color: #fff;
  text-align: left;
  font-weight: 400;
  font-size: clamp(18px, 1vw, 24px);
  border-bottom: 2px solid rgb(41, 41, 41);
`;

const TextContainer = styled.div`
  margin-bottom: 50px;
  width: 90%;
  color: #fff;
  border: 2px solid rgb(41, 41, 41);
  @media screen {
  }
`;

const About = (props: Props) => {
  return (
    <div>
      <AbUsh>Մեր մասին</AbUsh>
      <TransBox>
        <TransBoxBorder>
          <br />
          <PaboutTextTitle>«Էս Թի Ար» Ակումբ ՀԿ</PaboutTextTitle>
          <TextContainer>
            <PaboutText>
              2003 թվականին միավորվեցին մի խումբ տղաներ, ովքեր չէին պատկերացնում
              իրենց կյանքն առանց ավտոմեքենաների: Նրանց հիմնական շփման թեմաները
              մեքենաներն էին, ավտոսպորտը և տյունինգը: Քանի որ այդ ժամանակ
              տյունինգը Հայաստանում նոր էր զարգանում և շատերի համար դեռ
              նորություն էր, շատ երիտասարդներ էին հետաքրքրվում տյունինգով՝
              բացահայտելով իրենց համար նոր աշխարհ և ակամայից միավորվում էին
              միմյանց հետ՝ իրենց հետաքրքրությունները և իմացությունները կիսելու
              նպատակով: Այդպիսի մի նպատակ հետապնդող տղաներից մի քանիսը
              համախմբվեցին և ստեղծեցին "Street Racing" Armenia (Հայաստանի
              փողոցային ավտոմրցություններ) սիրողական ակումբը:
            </PaboutText>
            <PaboutText>
              2004-2007 թվականների ընթացքում այդ երկար անվանումը վերափոխվեց կարճ
              հապավումով՝ "STR": Ակումբը սկսեց կազմակերպել տարբեր տեսակի
              միջոցառումներ և մրցություններ՝ կապված ավտոմեքենաների հետ: Թող
              ներեն մեզ մեր ոստիկանության աշխատակիցները, բայց բացառություն չէին
              նաև գիշերային, փողոցային և բնականաբար անօրինական մրցումները: Բայց
              եկավ մի պահ, երբ Տիգրան Մկրտումյանը և Գևորգ Հայրապետյանը որոշեցին
              այս ամենը տեղափոխել օրինական դաշտ: 2008 թվականին "STR" ակումբը
              գրանցվեց՝ որպես սպորտային հասարակական կազմակերպություն, և հենց այդ
              տարվա գարնանը կազմակերպվեց մի լայնամասշտաբ մրցություն, որտեղ
              հյուրընկալվել էին մեր հարևան երկիր՝ Վրաստանի մարզիկները: 2008-2010
              թվականներին բոլոր միջոցառումները տեղի էին ունենում Նոր Հաճնի
              օդանավակայանում, սակայն 2010 թվականին, անկախության օրվան նվիրված,
              առաջին անգամ Հայաստանում կայացավ դրիֆտի բաց առաջնություն՝ Սասունցի
              Դավթի հրապարակում, որն ուրախություն պարգևեց թե՛ կազմակերպիչներին,
              և թե՛ մարզիկներին, քանի որ նախկինում դրիֆտ անց էր կացվում միմիայն
              Նոր Հաճնի օդանավակայանի տարածքում, բայց տվյալ տարացքի մակերեսը
              թույլլ չէր տալիս անվտանգ և կատարյալ "drifting" վարժություններ
              կատարել: Այդ տարվա աշնանը կազմակերպվեց նաև sprint-slalom՝ Հրազդան
              մարզադաշտի հարակից տարածքում, և առաջին անգամ կազմակերպվեց
              դռագ-ռեյսինգ 2010 "STR" գավաթ՝ Արցախի պողոտայում, որը բարեգործական
              բնույթ էր կրում, և ողջ հասույթը նվիրվեց էրեբունու վարչական շրջանի
              մանկապարտեզներին: Դա նույնպես տղաների համար մեծ ուրախություն էր:
            </PaboutText>
            <PaboutText>
              2011թվականին ակումբը կազմակերպեց ձևավոր վարում՝ Արցախի պողոտայի
              վրա, ԽՍՀՄ մրցարշավորդ՝ Արամ Թոխատյանի հիշատակին, որը կրկին կրեց
              բարեգործական բնույթ, և կրկին հասույթը նվիրաբերեց Էրեբունու
              վարչական շրջանի մանկապարտեզներին, ինչպես նաև մի շարք հետաքրքիր
              միջոցառումներ դրիֆտ, դռագ և այլն: 2012 թվականին ակումբը մասնակցեց
              ֆեդերացիայի կողմից կազմակերպված բոլոր միջոցառումներին և իր
              քայլերով փորձում էր զարգացնել ավտոսպորտը ՀՀ-ում և արդեն իսկ
              խրախուսում էր բոլոր ավտովարորդներին՝ զերծ մնալ փողոցային
              անկարգություններից: 2012 թ-ին կազմակերպեց նաև «Երևանյան տաքսի
              2012» «ձևավոր վարման» միջոցառումը՝ փորձելով բարձրացնել Երևանի
              տաքսի ոլորտի անվտանգությունը և մատուցվող ծառայությունների որակը,
              օրինակ՝ վարորդը պետք է իմանա ճ.պ. կանոնները, ունենա կրակմարիչ,
              բժշկական տուփ, ունենա համապատասխան համազգեստ, լինի սափրված, չլսի
              տհաճ երաժշտություն, չծխի ուղևորների ներկայությամբ և, որպես
              պարտադիր պայման, ավտոմեքենայի ներսում պետք է լինի հաճելի բուրմունք
              և այլն:
            </PaboutText>
            <PaboutText>
              Այդ թվականին «Ադրենալին» ասոցացիայի հետ համատեղ կազմակերպվեց "Drag
              Racing"՝ Իջևան քաղաքում: Նույն Ադրենալինի հետ կազմակերպեց "Big
              Race Drag"՝ Արցախի պողոտայի վրա, որտեղ մասնակցեցին մի քանի
              երկրներից ժամանած բեռնատարներ, այդ թվում նաև կին վարորդներ:
              Ակումբը ձեռք բերեց նոր մեքենաներ և սկսեց ծավալել ավելի լուրջ
              գործողություններ ավտոսպորտում, օրինակ՝ "Rally Cross" և լեռնային
              մրցություն: Կազմակերպվեց նաև կառտինգի «STR գավաթ» բաց առաջնություն
              Play City- ում: Եվ այսպես 2013 թվական: Ակումբը տարեսկզբին արդեն
              կազմեց տարվա գրաֆիկը, և միջոցառումների քանակը, կարելի էր ասել,
              ռեկորդային էր ակումբի համար:
            </PaboutText>
            <PaboutText>
              "STR" ակումբն առաջին անգամ անցկացրեց 5 փուլերից բաղկացած Drag
              Racing՝ «STR գավաթ 2013» անվանումով, որի առաջին փուլը նվիրված էր
              Մայրության և գեղեցկության տոնին (ապրիլի 7-ին):{" "}
            </PaboutText>
            <PaboutText>
              Ապրիլի 24-ին կազմակերպվեց լայնամասշտաբ երթ՝ նվիրված եղեռնի զոհերի
              հիշատակին՝ Երևանից դեպի Խոր Վիրապ: Անցկացվեցին մի շարք սպորտային
              պարապմունքներ՝ ակումբի տղաների պրոֆեսիոնալիզմը բարձրացնելու
              նպատակով: Կազմակերպչական աշխատանքների հետ համատեղ՝ ակումբը
              մասնակցեց նաև ՀՀ ավտոմոբիլային ֆեդերացիայի կողմից կազմակերպված՝
              մրցարշավորդ Արման Սիմոնյանի հիշատակին նվիրված, լեռնային մրցությանը
              (3 փուլով), որտեղ ակումբը զբաղեցրեց մրցանակային տեղեր: Հունիսի
              1-ին, երեխաների տոնի կապակցությամբ, ակումբը կազմակերպեց «Փոքրիկ
              վարորդ» մրցարշավը, որը մեծ ուրախություն պարգևեց երեխաներին և նրանց
              ծնողներին Կազմակերպեց 2 փուլից բաղկացած դրիֆտի և արագընթաց ձևավոր
              վարման բաց առաջնություններ՝ նվիրված ԽՍՀՄ մրցարշավորդ, քառակի
              չեմպիոն, ոսկե մեդալակիր՝ Հենրիկ Զարգարյանի հիշատակին: Առաջին փուլը
              կայացավ Դավիթաշեն վարչական շրջանում, իսկ 2-րդ և 3-րդ փուլերը՝
              Աբովյան քաղաքում:
            </PaboutText>
            <PaboutText>
              2013 թ-ին «Ռոյալ Արմենիա» ընկերության հովանավորության ներքո
              ակումբը ձեռք բերեց լուսացույց՝ իր բոլոր չափանիշներով, որի շնորհիվ
              այս տարվա drag-racing-ի 5 փուլերի ընթացքում գրանցվեցին նոր
              ռեկորդներ 13.3 12.8 12.5 12.4 12.2 402 մետրի վրա: Սա շատ կարևոր
              փաստ է ակումբի և ավտոսպորտի համար:
            </PaboutText>
          </TextContainer>
        </TransBoxBorder>
      </TransBox>
    </div>
  );
};

export default About;
